app/controllers/groups_controller.rb

  def show
	@group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]

  def edit
	@group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @group = Group.create(group_params)
---
INSERT INTO "groups" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "group101"], ["description", "first討論版\r\n"], ["created_at", "2015-08-25 20:36:00.541244"], ["updated_at", "2015-08-25 20:36:00.541244"]]

  def update
    @group = Group.find(params[:id])

    if @group.update(group_params)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "groups" SET "description" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["description", "first討論版\r\n哦哦哦哦哦哦"], ["updated_at", "2015-08-25 20:38:36.410506"], ["id", 1]]

  def destroy
    @group = Group.find(params[:id])
    @group.destroy
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]