app/controllers/posts_controller.rb

  def create
    @post = @group.posts.build(post_params)

    if @post.save
---
INSERT INTO "posts" ("content", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "1651w81efw6fw8gwgwgg"], ["group_id", 6], ["created_at", "2015-08-25 21:00:23.068235"], ["updated_at", "2015-08-25 21:00:23.068235"]]

  def destroy
    @post = @group.posts.find(params[:id])

    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."group_id" = ? AND "posts"."id" = ? LIMIT 1  [["group_id", 8], ["id", 2]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]

  def find_group
      @group = Group.find(params[:group_id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 8]]